{
  "A1": {
    "syntactic": "1. Syntactic Simplification Rules\n1.1. Splitting Complex Sentences\n1.2. Separating Noun, Adjective, and Adverb Clauses\n1.3. Standardizing Temporal Relations\n1.4. Making References Explicit\n1.5. Reducing Reported Speech\n1.6. Changing Passive Structures into Active Ones\n1.7. Adjusting Inverted Structures\n\nExample of splitting complex sentences for an A1 learner:\nOriginal: The success of large language models like GPT-4, which OpenAI uses behind ChatGPT, depends directly on strong computing power and special hardware designed to support it.\nSimplified: The success of ChatGPT depends on very strong computers. These computers are powerful and use special hardware.\n\nExample of separating noun, adjective, and adverb clauses for an A1 learner:\nOriginal: Recycle to reduce waste, increase reuse, and avoid single-use products.\nSimplified: Recycle. Reduce waste. Reuse things. Avoid single-use products.\n\nStandardizing Temporal Relations: In a narrative text, events should be told in the same tense throughout.\nUnnatural Usage: Alex came home from work. He had opened the door with his key. He put his jacket in the closet.\nNatural Usage: Alex came home from work. He opened the door with his key. He put his jacket in the closet.\n\nExample of making references explicit for an A1 learner:\nOriginal: Nobody had asked him.\nSimplified: Nobody asked Jack about it.\n\nExample of reducing reported speech for an A1 learner:\nOriginal: Sterling said that he had shown many works in Boston and then continued his speech.\nSimplified: Sterling said, “I showed many works in Boston.” Then he continued his speech.\n\nExample of changing passive into active for an A1 learner:\nOriginal: The new TV series was presented by ABC.\nSimplified: ABC presented the new TV series.\n\nExample of adjusting inverted structures for an A1 learner:\nOriginal: Not in the city was he seen for many days.\nSimplified: He was not seen in the city for many days.",
    "lexical": "2. Lexical Simplification Rules\n2.1. Replacing Rare Words with Frequent Ones (Including Idioms)\n2.2. Rewriting\n2.3. Deleting Words that Complicate or Lengthen Sentences\n2.4. Expressing Modality with Words\n2.5. Reducing Unusual Uses of Words (Semantic)\n\nExample of replacing rare with frequent words for an A1 learner:\nOriginal: This illness afflicted many people.\nSimplified: This illness affected many people.\n\nExample of rewriting for an A1 learner:\nOriginal: Moreover, apart from rebuilding the calm world his parents had created for many years, he expected nothing else from life.\nSimplified: He also wanted to marry and build a calm world. Just like his parents.\n\nExample of deleting words that complicate for an A1 learner:\nOriginal: Aren’t fears, anxieties, false crowds, and feelings of being ignored all present here as well?\nSimplified: Aren’t fears, anxieties, and false crowds here too?\n\nExample of expressing modality with words for an A1 learner:\nOriginal: He definitely had to put an end to this.\nSimplified: It was necessary to put an end to this.\n\nExample of reducing unusual word usage for an A1 learner:\nOriginal: He closed his books and took his pen, but he could not enjoy the words he wrote.\nSimplified: He wrote something, but he did not like his writing.",
    "elaboration": "3. Elaboration Rules\n3.1. Expanding Rare Words with Frequent Ones (Replacing Subordinate Terms with Superordinate Ones)\n3.2. Making Implicit Meanings and Presuppositions Explicit (Completing Ellipses)\n3.3. Making Connections Explicit (Using Conjunctions and Adverbs)\n3.4. Emphasizing Core Concepts through Repetition and Reinforcement\n\nExample of expanding rare words with frequent ones for an A1 learner:\nOriginal: He pointed at the window showing Eiffel with his head.\nSimplified: He showed the view.\n\nExample of making implicit meanings explicit for an A1 learner:\nOriginal: Recycle to reduce waste, increase reuse, and avoid single-use products.\nSimplified: Recycle. Reduce waste. Reuse things. Avoid single-use products.\n\nExample of making connections explicit for an A1 learner:\nOriginal: Siri helps with text editing and content creation, while ChatGPT integration provides additional support.\nSimplified: Siri helps with text editing and content creation. Also, Siri has ChatGPT integration. Thus, Siri also provides extra support.\n\nExample of emphasizing core concepts for an A1 learner:\nOriginal: Then he looked at the objects again.\nSimplified: Then he looked at the items again.\nExplanation: The word “objects” was replaced with “items” because “items” is more frequent in the text."
  },
  "A2": {
    "syntactic": "1. Syntactic Simplification Rules\n1.1. Splitting Complex Sentences\n1.2. Separating Noun, Adjective, and Adverb Clauses\n1.3. Standardizing Temporal Relations\n1.4. Making References Explicit\n1.5. Reducing Reported Speech\n1.6. Changing Passive Structures into Active Ones\n1.7. Adjusting Inverted Structures\n\nExample of splitting complex sentences for an A2 learner:\nOriginal: The success of large language models like GPT-4, which OpenAI uses behind ChatGPT, depends directly on strong computing power and special hardware designed to support it.\nSimplified: The success of ChatGPT depends on very strong computers. These computers are supported with special software and hardware.\n\nExample of separating clauses for an A2 learner:\nOriginal: Animals that cannot find enough food in winter spend this period in hibernation.\nSimplified: Animals cannot find enough food in winter. Therefore, they spend this period in hibernation.\n\nStandardizing Temporal Relations:\nUnnatural: Alex came home from work. He had opened the door with his key. He put his jacket in the closet.\nNatural: Alex came home from work. He opened the door with his key. He put his jacket in the closet.\n\nExample of making references explicit for an A2 learner:\nOriginal: Every leopard’s coat is unique. They have strong muscles and agile bodies.\nSimplified: Every leopard’s coat is unique. Leopards have strong muscles and agile bodies.\n\nExample of reducing reported speech for an A2 learner:\nOriginal: Theo said that the project was difficult and that in this exhibition he wanted to show the interaction of ants to people.\nSimplified: Theo said, “The project was difficult. In this exhibition, I wanted to show the interaction of ants to people.”\n\nExample of changing passive into active for an A2 learner:\nOriginal: A tsunami warning was not given.\nSimplified: The agency did not give a tsunami warning.\n\nExample of adjusting inverted structures for an A2 learner:\nOriginal: Put on his hat, wore his coat, and went out.\nSimplified: He put on his hat, wore his coat, and went out.",
    "lexical": "2. Lexical Simplification Rules\n2.1. Replacing Rare Words with Frequent Ones (Including Idioms)\n2.2. Rewriting\n2.3. Deleting Words that Complicate or Lengthen Sentences\n2.4. Expressing Modality with Words\n2.5. Reducing Unusual Uses of Words (Semantic)\n\nExample of replacing rare words for an A2 learner:\nOriginal: When a slight despair came to the surface, Jack took the bag, sprayed the girl’s perfume lightly into the cap, and smelled it deeply.\nSimplified: In such hopeless moments, he took the bag, sprayed the girl’s perfume lightly, and smelled it.\n\nExample of rewriting for an A2 learner:\nOriginal: If he were alone, would he endure so many words? But oh well!\nSimplified: If he were alone, he would not accept these words. But oh well!\n\nExample of deleting extra words for an A2 learner:\nOriginal: That is why, when winter comes, some animals migrate to warm places, and some go into hibernation.\nSimplified: That is why, in winter, some animals migrate to warm places, and some go into hibernation.\n\nExample of expressing modality for an A2 learner:\nOriginal: If the bus had left earlier, we would have arrived on time.\nSimplified: The bus left late. Therefore, we did not arrive on time.\n\nExample of reducing unusual usage for an A2 learner:\nOriginal: The sea swallowed my screams.\nSimplified: The sound of the sea covered the sound of my screams.",
    "elaboration": "3. Elaboration Rules\n3.1. Expanding Rare Words with Frequent Ones (Replacing Subordinate Terms with Superordinate Ones)\n3.2. Making Implicit Meanings and Presuppositions Explicit (Completing Ellipses)\n3.3. Making Connections Explicit (Using Conjunctions and Adverbs)\n3.4. Emphasizing Core Concepts through Repetition and Reinforcement\n\nExample of expanding rare words for an A2 learner:\nOriginal: The women surrounded the lady doctor and said they could find another house.\nSimplified: The women gathered around the lady doctor and said, “We can find another house.”\n\nExample of making implicit meanings explicit for an A2 learner:\nOriginal: Research shows that an important source of income in the video game industry is in-game purchases. However, there is a point to be careful about: such sudden purchases can cause financial problems for some players.\nSimplified: An important source of income in the video game industry is in-game purchases. But be careful: such sudden purchases can cause financial problems for some players.\n\nExample of making connections explicit for an A2 learner:\nOriginal: Since he had spent all his weekend money that day, he decided not to go out the next day.\nSimplified: He spent all his weekly money that day, so he decided to stay at home the next day.\n\nExample of emphasizing core concepts for an A2 learner:\nOriginal: Then he looked at the objects again.\nSimplified: Then he looked at the items again.\nExplanation: The word “objects” was replaced with “items” because “items” is more frequent in the text."
  },
  "B1": {
    "syntactic": "1. Syntactic Simplification Rules\n1.1. Splitting Complex Sentences\n1.2. Separating Noun, Adjective, and Adverb Clauses\n1.3. Standardizing Temporal Relations\n1.4. Making References Explicit\n1.5. Changing Passive Structures into Active Ones\n1.6. Adjusting Inverted Structures\n\nExample of splitting complex sentences for a B1 learner:\nOriginal: ChatGPT, trained on internet data, produces sentences word by word, choosing the most probable word after each.\nSimplified: ChatGPT is trained on internet data and produces sentences word by word. After each word, it chooses the most probable next word.\n\nExample of separating clauses for a B1 learner:\nOriginal: Life cycle analyses, which examine environmental effects of products, show that paper cups are not better than alternatives.\nSimplified: Life cycle analyses examine the environmental effects of products. These analyses show that paper cups are not better than alternatives.\n\nStandardizing Temporal Relations:\nUnnatural: Alex came home from work. He had opened the door with his key. He put his jacket in the closet.\nNatural: Alex came home from work. He opened the door with his key. He put his jacket in the closet.\n\nExample of making references explicit for a B1 learner:\nOriginal: Paper cups are part of daily life for many of us. Many of us also prefer them.\nSimplified: Paper cups are part of daily life for many of us. Many of us also prefer paper cups.\n\nExample of changing passive into active for a B1 learner:\nOriginal: A 5.5 magnitude earthquake in Nepal was reported by USGS.\nSimplified: USGS reported a 5.5 magnitude earthquake in Nepal.\n\nExample of adjusting inverted structures for a B1 learner:\nOriginal: Revealed was his entire secret.\nSimplified: His entire secret was revealed.",
    "lexical": "2. Lexical Simplification Rules\n2.1. Replacing Rare Words with Frequent Ones (Including Idioms)\n2.2. Rewriting\n2.3. Deleting Words that Complicate or Lengthen Sentences\n2.4. Expressing Modality with Words\n2.5. Reducing Unusual Uses of Words (Semantic)\n\nExample of replacing rare words for a B1 learner:\nOriginal: Describing the sad state often seen in bureaucratic life?\nSimplified: Describing this sad state often seen in bureaucratic life?\n\nExample of rewriting for a B1 learner:\nOriginal: The forest, thick with trees and poisonous vines, has not allowed anyone to pass until today.\nSimplified: No one has been able to pass through the dense forest full of poisonous vines until today.\n\nExample of deleting extra words for a B1 learner:\nOriginal: Some believed this situation came from our fragile economy, like the Titanic sinking in a stormy sea.\nSimplified: Some believed this situation came from the current economic conditions.\n\nExample of expressing modality for a B1 learner:\nOriginal: You cannot watch a movie until you finish your work.\nSimplified: Finish your work first, then you can watch a movie.\n\nExample of reducing unusual usage for a B1 learner:\nOriginal: He poured the words rushing through his fingers onto the page.\nSimplified: The words flowed from his fingers onto the page.",
    "elaboration": "3. Elaboration Rules\n3.1. Expanding Rare Words with Frequent Ones (Replacing Subordinate Terms with Superordinate Ones)\n3.2. Making Implicit Meanings and Presuppositions Explicit (Completing Ellipses)\n3.3. Making Connections Explicit (Using Conjunctions and Adverbs)\n3.4. Emphasizing Core Concepts through Repetition and Reinforcement\n\nExample of expanding rare words for a B1 learner:\nOriginal: When they entered the tiny apartment above the clinic, Emily shouted, “No way!”\nSimplified: When they entered the small apartment above the clinic, Emily shouted.\n\nExample of making implicit meanings explicit for a B1 learner:\nOriginal: ChatGPT can collect information and give satisfying answers. These answers can also be found on Google.\nSimplified: ChatGPT can collect information and give satisfying answers. These answers can also be found on Google.\n\nExample of making connections explicit for a B1 learner:\nOriginal: Water sources may contain pollutants. To identify them, a water drop microscope is used.\nSimplified: Water sources may contain pollutants. Therefore, a water drop microscope is used to identify them and make the water drinkable.\n\nExample of emphasizing core concepts for a B1 learner:\nOriginal: Forgotten, abandoned, ownerless objects.\nSimplified: Forgotten, abandoned, ownerless items.\nExplanation: The word “objects” was replaced with “items” because “items” is more frequent in the text."
  }
}
